/*
* ------------------------------------------------------------
* IMPORTANT: The contents of this file are auto-generated.
*
* This file may be updated by the Shopify admin theme editor
* or related systems. Please exercise caution as any changes
* made to this file may be overwritten.
* ------------------------------------------------------------
*/
{
  "sections": {
    "breadcrumbs": {
      "type": "breadcrumbs",
      "settings": {
      }
    },
    "image_with_text_overlay_8jXp9g": {
      "type": "image-with-text-overlay",
      "blocks": {
        "heading_HhgdPq": {
          "type": "heading",
          "settings": {
            "text": "Smart Light Strips",
            "heading_size": "h1"
          }
        },
        "text_HhPXHD": {
          "type": "text",
          "disabled": true,
          "settings": {
            "text": "<p>Yeelight smart lights brings you upgraded immersive gaming experience with game & music sync features and flowing colors.<\/p>",
            "description_size": "medium"
          }
        }
      },
      "block_order": [
        "heading_HhgdPq",
        "text_HhPXHD"
      ],
      "settings": {
        "image": "shopify:\/\/shop_images\/smart_light_strip.jpg",
        "image_parallax": false,
        "desktop_height": "desktop-height-450",
        "mobile_height": "mobile-height-350",
        "full_width": true,
        "content_width": "large",
        "content_position": "middle-center",
        "text_alignment": "center",
        "text_color": "#ffffff",
        "overlay_color": "#000000",
        "overlay_opacity": 0,
        "disable_top_spacing": true,
        "disable_bottom_spacing": true
      }
    },
    "rich_text_ywXme4": {
      "type": "rich-text",
      "blocks": {
        "heading_3bnbf7": {
          "type": "heading",
          "settings": {
            "text": "LED Strip Lights & LED Tape Light & Smart LED Strip Lights",
            "marker_style": "style1",
            "size": "h3",
            "marker_color": "#fd6262"
          }
        },
        "text_Tbm49x": {
          "type": "text",
          "settings": {
            "text": "<p>Experience convenience and control with our Smart LED Bulb and Smart Wifi Bulb, offering easy integration into your smart home setup.<\/p>",
            "custom_liquid": "",
            "size": "text-size-regular"
          }
        }
      },
      "block_order": [
        "heading_3bnbf7",
        "text_Tbm49x"
      ],
      "settings": {
        "text_width": "grid",
        "text_position": "left",
        "text_alignment": "left",
        "color_bg": "rgba(0,0,0,0)",
        "color_heading": "#1a1c1d",
        "color_text": "#2c2d2e",
        "color_links": "#2c2d2e",
        "disable_top_spacing": false,
        "disable_bottom_spacing": false
      }
    },
    "template-header": {
      "type": "template-header",
      "disabled": true,
      "settings": {
        "show_collection_image": false,
        "show_collection_description": true,
        "show_subcollections": true,
        "color_subcollection_bg": "#ffffff",
        "color_subcollection_text": "#303c43",
        "display_description": true
      }
    },
    "product-grid": {
      "type": "main-collection-product-grid",
      "settings": {
        "products_per_page": 12,
        "columns_desktop": 4,
        "pagination_type": "paginated",
        "enable_filtering": false,
        "enable_sorting": true,
        "show_counts": true,
        "filter_color_swatches": true,
        "filters_collapsed": false,
        "facets_desktop": "sidebar"
      }
    },
    "collapsible_content_f67qVU": {
      "type": "collapsible-content",
      "blocks": {
        "collapsible_tab_8HNRAU": {
          "type": "collapsible_tab",
          "settings": {
            "heading": "Can I cut led strip lights?",
            "open": false,
            "content": "<p>Yes, you can cut <strong>LED strip lights<\/strong>, but there are certain guidelines you should follow to ensure they continue to work properly and safely:<\/p><ul><li>Cutting Points: Look for the designated cutting points along the strip, usually marked by a line and sometimes scissors icons. These are safe points where you can cut the strip without damaging the electrical circuitry. Cutting outside of these points can lead to the entire strip not working properly.<\/li><li>Tools: Use a pair of sharp scissors or a knife to make a clean, straight cut along the designated line. This ensures that the led tape light will fit properly where you want to install it and that it can be connected to power safely.<\/li><li>Power Off: Ensure that the led light strips are disconnected from any power source before cutting to prevent any electrical shock or damage to the strip.<\/li><li>Measure Twice, Cut Once: Before cutting, double-check the length you need. Remember, once you cut the led tape light, you can't make it longer again.<\/li><li>Connecting After Cutting: If you plan to use the cut sections, you may need additional connectors or soldering skills to attach a new power supply or connect different pieces.<\/li><li>Waterproof Strips: If your <strong>led light strips<\/strong> are waterproof, cutting it will remove the waterproofing from the cut end. You might need to seal the end with silicone or heat-shrink tubing to maintain some level of water resistance.<\/li><\/ul><p>Always refer to the manufacturer's instructions for specific guidelines related to your LED strip lights, as different models and brands may have unique requirements or features.<\/p>",
            "page": ""
          }
        },
        "collapsible_tab_pJUADQ": {
          "type": "collapsible_tab",
          "settings": {
            "heading": "How should I install my smart led strip lights to avoid damage?",
            "open": false,
            "content": "<p>Try to reduce rubbing, and violent cutting, and use in high or low-temperature environments. It will not be damaged unless it is intentional. You can follow these simple install steps:<\/p><ul><li>Clean the Area: Make sure the surface where you'll attach the led tape light is clean and dry.<\/li><li>Plan the Layout: Decide where exactly you want the smart led strip lights to go. Avoid sharp bends.<\/li><li>Test the Lights: Before sticking them to the surface, connect the LEDs to power and check if they all light up.<\/li><li>Peel and Stick: Gently remove the backing and stick the <strong>LED strip<\/strong> where you want it.<\/li><li>Secure the Connection: Make sure the power connection is secure and matches the LED strip’s voltage requirements.<\/li><li>Avoid Overheating: Don't cover the LED strip; they need air to cool down.<\/li><\/ul>",
            "page": ""
          }
        },
        "collapsible_tab_kYA9dN": {
          "type": "collapsible_tab",
          "settings": {
            "heading": "How to connect smart led strip lights?",
            "open": false,
            "content": "<p>With the led light strips extension package, use connectors to assemble the joints.<\/p>",
            "page": ""
          }
        },
        "collapsible_tab_MJtmAT": {
          "type": "collapsible_tab",
          "settings": {
            "heading": "How long do led strip lights last?",
            "open": false,
            "content": "<p><strong>LED strip lights<\/strong> typically have a long lifespan. On average, they can last anywhere from 25,000 to 50,000 hours. This range can vary based on several factors such as the quality of the <strong>LED strips<\/strong>, the operating environment, and how well they are maintained.<br\/><br\/>For instance, higher quality smart led strip lights with better heat management and more durable materials will generally last longer. On the other hand, <strong>smart led strip lights<\/strong> exposed to high temperatures, frequent on-off cycling, or improper installation may have a shorter lifespan. Regular maintenance and avoiding excessive bending or twisting can also help extend their life.<br\/><br\/>In practical terms, if you use your <strong>LED strip lights<\/strong> for 8 hours a day, they could last anywhere from around 8 to 17 years.<\/p>",
            "page": ""
          }
        },
        "collapsible_tab_9QDbCL": {
          "type": "collapsible_tab",
          "settings": {
            "heading": "What are the differences between LED and regular light bulbs?",
            "open": false,
            "content": "<p><a href=\"\/collections\/smart-bulb\" title=\"Smart Bulb\">LED bulbs<\/a> are brighter than lamp beads. Generally speaking, 1W LED lamp is equivalent to the brightness of 10W ordinary lamp beads, so LED lamps with the same wattage are much brighter than ordinary lamp beads. Led lamps are energy-saving lamps. They have the advantages of energy saving, durability, environmental protection, soft light and strong brightness, but the only disadvantage is that the price is a bit high.<\/p>",
            "page": ""
          }
        },
        "collapsible_tab_FWn3Wc": {
          "type": "collapsible_tab",
          "settings": {
            "heading": "Why won't my led strip lights turn on?",
            "open": false,
            "content": "<p>You can check whether the power supply and adapter are powered on, whether there is any problem with the control box, and whether the lamp beads are cut incorrectly.<\/p>",
            "page": ""
          }
        },
        "collapsible_tab_7cwwGG": {
          "type": "collapsible_tab",
          "settings": {
            "heading": "How do I choose the right power supply for my led light strips?",
            "open": false,
            "content": "<ul><li>Match Voltage: Ensure the power supply matches the led light strips' voltage requirement, typically 12V or 24V.<\/li><li>Calculate Power Needs: Look at the wattage per meter specified for your <strong>led tape light,<\/strong> then multiply this by the total length you're using to get the total wattage required.<\/li><li>Choose the Right Power Supply: Select a power supply that offers at least 20% more power than your total calculated wattage to avoid overloading and overheating. For example, if your total wattage is 50 watts, choose a power supply that provides at least 60 watts.<\/li><li>Check Current Capacity: Make sure the maximum current capacity (amperage) of the power supply is at least equal to the current required by your <strong>led tape light<\/strong>.<\/li><li>Adapt to Installation Environment: Consider whether you need a waterproof or special material power supply based on the installation location (indoor or outdoor).<\/li><li>Quality and Safety: Opt for a high-quality power supply with safety features like overload protection and short circuit protection. If possible, choose products with safety certifications such as UL or CE.<\/li><\/ul>",
            "page": ""
          }
        },
        "collapsible_tab_LnkaJU": {
          "type": "collapsible_tab",
          "settings": {
            "heading": "Is solid or stranded wire better for led light strips?",
            "open": false,
            "content": "<p>Our products are made of glue, which gives them a better look and feel.<\/p>",
            "page": ""
          }
        },
        "collapsible_tab_9NDFAT": {
          "type": "collapsible_tab",
          "settings": {
            "heading": "Where should I put LED strip lights?",
            "open": false,
            "content": "<p><strong>LED strip lights<\/strong> are versatile and can be placed in different locations to enhance the ambience. For example, the back of a TV, computer, or desk. You can also decorate room wall and Christmas tree<\/p>",
            "page": ""
          }
        }
      },
      "block_order": [
        "collapsible_tab_8HNRAU",
        "collapsible_tab_pJUADQ",
        "collapsible_tab_kYA9dN",
        "collapsible_tab_MJtmAT",
        "collapsible_tab_9QDbCL",
        "collapsible_tab_FWn3Wc",
        "collapsible_tab_7cwwGG",
        "collapsible_tab_LnkaJU",
        "collapsible_tab_9NDFAT"
      ],
      "settings": {
        "heading": "|FAQ|",
        "marker_style": "style1",
        "description": "<p>Designed into a unique shape and E26\/E27 base, Yeelight’s LED smart bulbs can easily match your base and at the same time be a pleasure to your eyes.<\/p>",
        "color_bg": "rgba(0,0,0,0)",
        "color_heading": "#1a1c1d",
        "marker_color": "#fd6262",
        "color_text": "#2c2d2e",
        "color_links": "#2c2d2e",
        "color_border": "#dadce0",
        "disable_top_spacing": false,
        "disable_bottom_spacing": false
      }
    }
  },
  "order": [
    "breadcrumbs",
    "image_with_text_overlay_8jXp9g",
    "rich_text_ywXme4",
    "template-header",
    "product-grid",
    "collapsible_content_f67qVU"
  ]
}
