/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "1661619382b4020fa2": {
      "type": "rich-text",
      "blocks": {
        "166161938159ca8988-1": {
          "type": "heading",
          "settings": {
            "text": "Giveaway Terms & Conditions",
            "marker_style": "style1",
            "size": "h2",
            "marker_color": "#fd6262"
          }
        },
        "text_UrCjLG": {
          "type": "text",
          "settings": {
            "text": "<p></p><p><strong>1. Event Duration</strong>: The event will run from November 26, 2024, to December 5, 2024, PST (Pacific Standard Time).</p><p><strong>2. Eligibility</strong>: This giveaway is open only to individuals residing in the United States and Canada. Participants must be at least 18 years old to enter.</p><p><strong>3. How to Enter</strong>: To enter the giveaway, participants must provide their email address. No purchase is necessary to enter the event.</p><p><strong>4. Prize Selection</strong>: 20 winners will be selected at random by Yeelight after the event ends. The winners will be notified via the email address they provided on December 6, 2024, PST.</p><p><strong>5. Winner Notification and Response</strong>: Winners must respond to the notification email within 48 hours, providing their full name, shipping address, phone number, and zip code. Failure to respond within the given time frame will result in the selection of an alternate winner. (Note: Personal information will only be used for shipping purposes and will not be retained by Yeelight.)</p><p><strong>6. Prize Delivery</strong>: The provided shipping address must be within the United States or Canada. If the address is outside of these two countries, Yeelight reserves the right to select an alternate winner. Yeelight will ship the prizes to the winners within 5 business days after receiving the required information.</p><p><strong>7. Prize Details</strong>: The prizes include:</p><ul><li>5 Yeelight Curtain Lights</li><li>5 Yeelight Christmas String Lights (33ft)</li><li>5 Yeelight Smart LED Basic Strip Lights (20ft)</li></ul><p><strong>8. Email Subscription</strong>: By participating in this event, participants agree to subscribe to the Yeelight newsletter. Subscription can be canceled at any time.</p><p><strong>9. Entry Limits</strong>: Each email address may only be used to enter once. Participants are prohibited from submitting multiple entries using different email addresses.</p><p><strong>10. Event Final Decision</strong>: The final interpretation of this giveaway event and its rules rests with Yeelight.</p><p><strong>11. Privacy Policy</strong>: By participating in this giveaway, participants agree to Yeelight’s privacy policy. The personal information collected will only be used to notify winners and fulfill prize shipments.</p>",
            "custom_liquid": "",
            "size": "text-size-regular"
          }
        }
      },
      "block_order": [
        "166161938159ca8988-1",
        "text_UrCjLG"
      ],
      "settings": {
        "text_width": "xlarge",
        "text_position": "center",
        "text_alignment": "left",
        "color_bg": "rgba(0,0,0,0)",
        "color_heading": "#1a1c1d",
        "color_text": "#151515",
        "color_links": "#151515",
        "disable_top_spacing": false,
        "disable_bottom_spacing": false
      }
    }
  },
  "order": [
    "1661619382b4020fa2"
  ]
}
